/**
 * @file BubleSort.h
 * @brief バブルソート部品のヘッダーファイル
 * @author ths80587-Hirai
 * @date 2018.09.04
 */

#ifndef _BUBLESORT_H_
#define _BUBLESORT_H_

/* -------------------------------------------------------------------------- */
/* インクルード宣言															  */
/* -------------------------------------------------------------------------- */
#include"StudentScore.h"
#include"SortController.h"

/* -------------------------------------------------------------------------- */
/* プロトタイプ宣言															  */
/* -------------------------------------------------------------------------- */
studentScore *BubleSortByAsc(studentScore *studentScore);

#endif // _BUBLESORT_H_