//* -------------------------------------------------------------------------- */
/* File:Display.h															  */
/* Overview:                                                                  */
/*	画面表示に関する関数宣言を定義する。                                            */
/*                                                                            */
/*                                                Author : HAL Tokyo - Hirai  */
/*                                                Date   : 2018.09.08         */
/* -------------------------------------------------------------------------- */

#ifndef DISPLAY_H_
#define DISPLAY_H_

/* -------------------------------------------------------------------------- */
/* インクルード宣言															  */
/* -------------------------------------------------------------------------- */
#include"StudentScore.h"

/* -------------------------------------------------------------------------- */
/* プロトタイプ宣言															  */
/* -------------------------------------------------------------------------- */
/**
 * 成績情報表示
 *	名前、各教科の得点、合計点を画面に表示する
 *
 *	@param *studentScore[] 成績情報を格納した構造遺体配列のポインタ
 */
void displayGrade(studentScore *studentScore[]);

/* 成績情報入力画面表示 */
void displayInputStart();
void displayInput();

#endif // !DISPLAY_H_