/* -------------------------------------------------------------------------- */
/* File:Display.c															  */
/* Overview:                                                                  */
/*	画面表示関数を定義する。			                                          */
/*                                                                            */
/*                                                Author : HAL Tokyo - Hirai  */
/*                                                Date   : 2018.09.09         */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/* インクルード宣言															  */
/* -------------------------------------------------------------------------- */
#include<stdio.h>

#include"Display.h"
#include"Error.h"

/* -------------------------------------------------------------------------- */
/* displayTitle														  */
/* -------------------------------------------------------------------------- */
void displayTitle()
{
	printf("\n");
	printf("   ***** 成績管理アプリケーション *****\n");
	printf("\n");

}

/* -------------------------------------------------------------------------- */
/* displayInputStart														  */
/* -------------------------------------------------------------------------- */
void displayInputStart() 
{
	printf("成績入力\n");
	printf("\n");
	printf("********************************************************************************************************************\n");
	printf("   学籍番号および各教科の得点を入力してください。\n");
	printf("   【入力ルール】\n");
	printf("      学籍番号:p[4桁の数字]\n");
	printf("      各得点入力について:\n");
	printf("        ・英語、数学、国語、理科、社会の順に0～100点までで入力してください。\n");
	printf("        ・各入力の間は半角スペース1つ分空けてください。\n");
	printf("   【補足】\n");
	printf("      ・入力ルール通りに入力しないと、正常にアプリにデータが取り込まれなかったり、エラーが発生したりします。\n");
	printf("      ・終了するには学籍番号入力欄に\"EOF\"と入力してください。\n");
	printf("********************************************************************************************************************\n");
}

/* -------------------------------------------------------------------------- */
/* displaySeparatorLine														  */
/* -------------------------------------------------------------------------- */
void displaySeparatorLine()
{
	printf("+++++++++++++++++++++++++\n");
}

/* -------------------------------------------------------------------------- */
/* displaySeparatorLine														  */
/* -------------------------------------------------------------------------- */
void displayInputEnd()
{
	printf("\n");
	printf("成績入力を終了します。\n");
}

/* -------------------------------------------------------------------------- */
/* displaySequenceEnd														  */
/* -------------------------------------------------------------------------- */
void displaySequenceEnd()
{
	printf("####################################################################################################################\n");
	printf("\n");
}

/* -------------------------------------------------------------------------- */
/* displayNewLine															  */
/* -------------------------------------------------------------------------- */
void displayNewLine()
{
	printf("\n");
}

/* -------------------------------------------------------------------------- */
/* displayResultTitle														  */
/* -------------------------------------------------------------------------- */
void displayResultTitle()
{
	printf("ソート結果表示\n");
}

/* -------------------------------------------------------------------------- */
/* displaySubject															  */
/* -------------------------------------------------------------------------- */
void displaySubject(char *adjSubject)
{
	printf("    Subject: %s\n", adjSubject);
}

/* -------------------------------------------------------------------------- */
/* displaySortPattern														  */
/* -------------------------------------------------------------------------- */
void displaySortPattern(char *sortPattern)
{
	printf("    Order  : %s\n", sortPattern);
}

/* -------------------------------------------------------------------------- */
/* displaySortResult														  */
/* -------------------------------------------------------------------------- */
void displaySortResult(studentGrade *studentsGrade)
{
	int errCode;
	int displayNum = 1;

	/* validation */
	if (studentsGrade == NULL) {
		errCode = XXX_NULL_PARAMETER;
		e_pt->errorCode = errCode;
		e_pt->errorMesage[0] = "Parameter(studentsGrade) is NULL.";
		return;
	}

	do {
		printf("%2d. %s 英語：%3d 国語：%3d 数学：%3d 理科：%3d 社会：%3d\n",
			displayNum,
			studentsGrade->id,
			studentsGrade->tokuten[ENGLISH],
			studentsGrade->tokuten[LANGUAGE],
			studentsGrade->tokuten[MATH],
			studentsGrade->tokuten[SCIENCE],
			studentsGrade->tokuten[SOCIETY]);
		studentsGrade = studentsGrade->next;
		displayNum++;
	} while (studentsGrade != NULL);
}

void displaySortResultEnd()
{
	printf("\n");
	printf("ソート結果表示を終了します。\n");
}