/**
* @file Error.h
* @brief エラー情報を定義したヘッダーファイル
* @author ths80587-Hirai
* @date 2018.09.04
*/
#ifndef _ERROR_H_
#define _ERROR_H_

/* -------------------------------------------------------------------------- */
/* マクロ定義																	  */
/* -------------------------------------------------------------------------- */
#define XXX_OK	0
#define XXX_NULL_PARAMETER 1001
#define XXX_INVALID_PARAMETER 1002

/* -------------------------------------------------------------------------- */
/* 構造体宣言																	  */
/* -------------------------------------------------------------------------- */
typedef struct error {
	int errorCode;
	char *errorMesage[];
} error;

/* -------------------------------------------------------------------------- */
/* グローバル変数宣言															  */
/* -------------------------------------------------------------------------- */
//static int *e_pt;
static struct error *e_pt;

#endif // _ERROR_H_