//* -------------------------------------------------------------------------- */
/* File:GradeDisplay.h														  */
/* Overview:                                                                  */
/*	成績情報を画面出力する関数宣言を定義する。                                       */
/*                                                                            */
/*                                                Author : HAL Tokyo - Hirai  */
/*                                                Date   : 2018.09.08         */
/* -------------------------------------------------------------------------- */

#ifndef GREADEDISPLAY_H_
#define GREADEDISPLAY_H_

/* -------------------------------------------------------------------------- */
/* インクルード宣言															  */
/* -------------------------------------------------------------------------- */
#include"StudentGrade.h"

/* -------------------------------------------------------------------------- */
/* プロトタイプ宣言															  */
/* -------------------------------------------------------------------------- */
/**
* 成績画面表示
*	指定された科目、並び順に応じて、成績画面表示を行う。
*
*/
void displayGrade(studentGrade *studentsGrade, char *subject, char *sortPattern);

#endif // !GREADEDISPLAY_H_