//* -------------------------------------------------------------------------- */
/* File:GradeWriter.h														  */
/* Overview:                                                                  */
/*	成績情報を出力する関数宣言を定義する。                                           */
/*                                                                            */
/*                                                Author : HAL Tokyo - Hirai  */
/*                                                Date   : 2018.09.08         */
/* -------------------------------------------------------------------------- */

#ifndef GREADEWRITER_H_
#define GREADEWRITER_H_

/* -------------------------------------------------------------------------- */
/* インクルード宣言															  */
/* -------------------------------------------------------------------------- */
#include"StudentScore.h"

/* -------------------------------------------------------------------------- */
/* プロトタイプ宣言															  */
/* -------------------------------------------------------------------------- */
/**
 * 成績書き込み
 *	名前、各教科の得点、合計点をCSV形式でファイルに出力する
 *
 *	@param gradeSummaryFilePath[256] 成績情報の出力先ファイルパス
 *	@param *studentScore[] 成績情報を格納した構造遺体配列のポインタ
 */
void gradeRead(char gradeSummaryFilePath[256], studentScore *studentScore[]);

#endif // !GREADEWRITER_H_