//* -------------------------------------------------------------------------- */
/* File:GradeWriter.h														  */
/* Overview:                                                                  */
/*	成績情報を出力する関数宣言を定義する。                                           */
/*                                                                            */
/*                                                Author : HAL Tokyo - Hirai  */
/*                                                Date   : 2018.09.08         */
/* -------------------------------------------------------------------------- */

#ifndef GREADEWRITER_H_
#define GREADEWRITER_H_

/* -------------------------------------------------------------------------- */
/* インクルード宣言															  */
/* -------------------------------------------------------------------------- */
#include"StudentGrade.h"

/* -------------------------------------------------------------------------- */
/* グローバル変数宣言	   														  */
/* -------------------------------------------------------------------------- */
static const char *BASE_FILE_NAME = "GradeSummaryOf";
static const char *ADD_FILE_NAME_SORT_PATTERN = { "SortedIn" };


/* -------------------------------------------------------------------------- */
/* プロトタイプ宣言															  */
/* -------------------------------------------------------------------------- */
/**
 * 成績書き込み
 *	名前、各教科の得点、合計点をCSV形式でファイルに出力する
 *
 *	@param *studentGrade 成績情報を格納した構造遺体のポインタ
 *	@param subject 教科
 *  @param sortPattern ソートロジック(昇順 or 降順)
 */
void writeGradeInCSVFormat(studentGrade *studentsGrade, const char *subject, const char *sortPattern);

#endif // !GREADEWRITER_H_