/* -------------------------------------------------------------------------- */
/* File:GradeReader.h														  */
/* Overview:                                                                  */
/*	成績情報を読み込む関数宣言を定義する。                                          */
/*                                                                            */
/*                                                Author : HAL Tokyo - Hirai  */
/*                                                Date   : 2018.09.08         */
/* -------------------------------------------------------------------------- */

#ifndef GRADEREADER_H_
#define GRADEREADER_H_

/* -------------------------------------------------------------------------- */
/* インクルード宣言															  */
/* -------------------------------------------------------------------------- */
#include"StudentScore.h"

/* -------------------------------------------------------------------------- */
/* プロトタイプ宣言															  */
/* -------------------------------------------------------------------------- */
/**
 * 成績読み込み
 *	画面から学籍番号と5教科分の得点を入力し、それを成績構造体に格納する。
 *
 *	@param studentMasterFilePath[256] 生徒情報のマスタファイルのパス
 *	@param *studentScore[] 成績情報を格納するための構造遺体配列のポインタ
 */
void gradeRead(char *studentMasterFilePath[], studentScore *studentGrade[]);

#endif // !GRADEREADER_H_