/**
 * @file SortController.h
 * @brief ソートコントローラ部品のヘッダーファイル
 * @author ths80587-Hirai
 * @date 2018.09.04
 */
#ifndef _SORTCONTROLLER_H_
#define _SORTCONTROLLER_H_

/* -------------------------------------------------------------------------- */
/* インクルード宣言															  */
/* -------------------------------------------------------------------------- */
#include"StudentGrade.h"

/* -------------------------------------------------------------------------- */
/* 列挙型宣言																	  */
/* -------------------------------------------------------------------------- */
enum SortLogic {
	BUBLESORT_BY_ASC, BUBLESORT_BY_DESC
};

/* -------------------------------------------------------------------------- */
/* プロトタイプ宣言															  */
/* -------------------------------------------------------------------------- */
/**
 * ソートコントローラ
 * 
 * 引数：studentsGrade...成績構造体
 *		sortLogic...ソートロジック(列挙型変数)
 *		sortKey...ソートキー(教科、列挙型変数)
 */
void SortController(studentGrade *studentsGrade, enum SortLogic sortLogic, enum Subject sortKey);

#endif // _SORTCONTROLLER_H_