/**
 * @file SortController.h
 * @brief ソートコントローラ部品のヘッダーファイル
 * @author ths80587-Hirai
 * @date 2018.09.04
 */
#ifndef _SORTCONTROLLER_H_
#define _SORTCONTROLLER_H_

/* -------------------------------------------------------------------------- */
/* インクルード宣言															  */
/* -------------------------------------------------------------------------- */
#include"StudentScore.h"

/* -------------------------------------------------------------------------- */
/* 列挙型宣言																	  */
/* -------------------------------------------------------------------------- */
enum SortLogic {
	BUBLESORT_BY_ASC, BUBLESORT_BY_DESC
};

/* -------------------------------------------------------------------------- */
/* プロトタイプ宣言															  */
/* -------------------------------------------------------------------------- */
studentScore *SortController(enum SortLogic sortlogic, studentScore *studentScore);

#endif // _SORTCONTROLLER_H_